#+TITLE: Results

This directory contains performance comparison of models.

PLANNED STRUCTURE:

- exp-name
  - target-name-one
    - model-name-one.csv
    - model-name-two.csv
    - ...
  - target-name-two

#+BEGIN_SRC bash :results output
tree -L 2
#+END_SRC

#+RESULTS:
#+begin_example
.
├── cnn
│   ├── seasons-14-to-5
│   └── seasons-4-to-3
├── cnn-weeks
│   ├── seasons-14-to-5
│   └── seasons-4-to-3
├── mdn
│   ├── seasons-14-to-5
│   └── seasons-4-to-3
├── mdn-weeks
│   ├── seasons-14-to-5
│   └── seasons-4-to-3
├── README.org
├── residual
│   └── seasons-14-to-5
├── seasons-14-to-5
└── seasons-4-to-3

16 directories, 1 file
#+end_example

#+BEGIN_SRC bash
cat ./cnn-weeks/seasons-14-to-5/1_eval.csv
#+END_SRC

#+RESULTS:
|       |               kcde |                kde |             sarima |         n-ensemble |       ave-ensemble |      prod-ensemble |
| nat   |  2.359958422842599 |  3.293009724925219 | 2.3238333896658663 | 2.5994125188965547 |  2.508372028035778 | 2.2185292504668728 |
| hhs1  | 2.3731624924394468 | 3.3438830250275684 | 2.6156874411952105 | 2.3034216291026066 |  2.670656191973582 |  2.298726456052948 |
| hhs2  | 2.9480758870546753 | 3.7089820733368564 |  3.071411078763393 |  2.783196754361454 |  3.174185227791773 | 2.8317586513940056 |
| hhs3  | 2.7031736469838727 | 3.4812538770392125 |   3.02555717073783 |  2.700612500309944 | 2.9846970667993635 | 2.5893186317365733 |
| hhs4  | 2.5725190432097342 | 3.4286623300391117 | 2.5178994632115654 | 2.5555798827033294 |  2.697851903373888 | 2.4481039999440153 |
| hhs5  |  2.437626407372474 | 3.3910215615682135 | 2.5828037538114144 |  2.438187275277941 | 2.6562179446653236 |  2.316004708347621 |
| hhs6  | 3.3731454522840787 |  4.462503253392055 | 3.6625062829204826 | 3.5162079569540525 |  3.719173280182653 | 3.4107338711863386 |
| hhs7  | 2.7970346641778208 | 3.5094641138857434 | 2.8179077188113824 |  2.675148211811718 | 2.9626949837379515 | 2.7216708050617116 |
| hhs8  | 2.5826440921512535 | 3.4191441352543244 |  2.812678927765497 | 2.4016113398890746 | 2.8670951320472895 |  2.520873670691728 |
| hhs9  | 2.9457565357338296 | 3.6781780683417926 | 3.1804688530681138 |   2.92978956432719 | 3.2083596069031937 |  2.702004803572497 |
| hhs10 | 2.8026810187759605 |  3.389433260355283 |  2.715116723226911 | 2.6688182542198584 | 2.8957631580850696 | 2.5710912600503604 |
| all   | 2.7177979693659737 | 3.5550486748332113 |  2.847806436652518 | 2.6883623534412475 | 2.9404605930541705 |  2.602619646227699 |

#+BEGIN_SRC bash
cat ./mdn-weeks/seasons-14-to-5/1_eval.csv
#+END_SRC

#+RESULTS:
|       |               kcde |                kde |             sarima |         n-ensemble |       ave-ensemble |      prod-ensemble |
| nat   |  2.359958422842599 |  3.293009724925219 | 2.3238333896658663 | 2.4902572260586577 |  2.508372028035778 | 2.2185292504668728 |
| hhs1  | 2.3731624924394468 | 3.3438830250275684 | 2.6156874411952105 | 2.3698830772610773 |  2.670656191973582 |  2.298726456052948 |
| hhs2  | 2.9480758870546753 | 3.7089820733368564 |  3.071411078763393 |  2.701549816132995 |  3.174185227791773 | 2.8317586513940056 |
| hhs3  | 2.7031736469838727 | 3.4812538770392125 |   3.02555717073783 |  2.665110872084987 | 2.9846970667993635 | 2.5893186317365733 |
| hhs4  | 2.5725190432097342 | 3.4286623300391117 | 2.5178994632115654 |   2.55894912398862 |  2.697851903373888 | 2.4481039999440153 |
| hhs5  |  2.437626407372474 | 3.3910215615682135 | 2.5828037538114144 |  2.502548914342693 | 2.6562179446653236 |  2.316004708347621 |
| hhs6  | 3.3731454522840787 |  4.462503253392055 | 3.6625062829204826 |  3.410341118786274 |  3.719173280182653 | 3.4107338711863386 |
| hhs7  | 2.7970346641778208 | 3.5094641138857434 | 2.8179077188113824 |  2.601506156366398 | 2.9626949837379515 | 2.7216708050617116 |
| hhs8  | 2.5826440921512535 | 3.4191441352543244 |  2.812678927765497 | 2.4883002253533224 | 2.8670951320472895 |  2.520873670691728 |
| hhs9  | 2.9457565357338296 | 3.6781780683417926 | 3.1804688530681138 | 2.7753852452599723 | 3.2083596069031937 |  2.702004803572497 |
| hhs10 | 2.8026810187759605 |  3.389433260355283 |  2.715116723226911 | 2.6484786721555227 | 2.8957631580850696 | 2.5710912600503604 |
| all   | 2.7177979693659737 | 3.5550486748332113 |  2.847806436652518 |  2.655664586162779 | 2.9404605930541705 |  2.602619646227699 |
